Data/TestFiles/cases/ViscousTubeBundle/case/0/k
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{

    inlet
    {
        type        turbulentIntensityKineticEnergyInlet;
        intensity   0.05;
        value       $internalField;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }

    wall
    {
        type        kqRWallFunction;
        value       $internalField;
    }

    defaultFaces
    {
        type        zeroGradient;
    }

    MeshRefinement001
    {
        type        empty;
    }

    MeshRefinement001BackFace
    {
        type        empty;
    }

}

// ************************************************************************* //
